In [3]:
import matplotlib.pyplot as plt
import numpy as np
from sklearn.datasets import make_classification
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report, confusion_matrix
import pandas as pd

In [18]:
#Clean data
e_data = pd.read_csv("https://www.dropbox.com/s/ey2y94hyfclgl98/clean_data.csv?dl=1" , header = 0)

In [5]:
print (e_data)

       Unnamed: 0  Latitude  Longitude   Depth  Magnitude  Month   Day  \
0               0   19.2460   145.6160  131.60        6.0      1   2.0
1              39   53.0080  -162.0080   17.80        6.4      2   6.0
2              44   53.1910  -161.8590   22.50        6.3      2   6.0
3              57   21.5270   143.0810  340.00        5.6      2  17.0
4              86   53.2920  -162.3310   20.00        5.7      3  13.0
...           ...       ...        ...     ...        ...    ...   ...
18720       23325    6.1142   -82.5906   10.00        5.6     11  12.0
18721       23359  -35.2021    54.0219   10.00        5.5     12   1.0
18722       23365   11.0316   -60.9005   31.75        5.9     12   6.0
18723       23397  -10.1785   160.9149   10.00        6.0     12  20.0
18724       23398  -10.1549   160.7816   10.38        5.5     12  20.0

         Year    Country Name  Density  Population
0      1965.0   United States       21   194303000
1      1965.0   United States       21   194303000
2      1965.0   United States       21   194303000
3      1965.0   United States       21   194303000
4      1965.0   United States       21   194303000
...       ...             ...      ...         ...
18720  2016.0          Panama       54     4037078
18721  2016.0      Madagascar       42    24894380
18722  2016.0  United Kingdom      271    65595565
18723  2016.0        Thailand      135    68971331
18724  2016.0        Thailand      135    68971331

[18725 rows x 11 columns]

In [19]:
print(list(e_data.columns))

['Unnamed: 0', 'Latitude', 'Longitude', 'Depth', 'Magnitude', 'Month', 'Day', 'Year', 'Country Name', 'Density', 'Population']

In [32]:
e_data.drop(e_data.columns[[0, 3, 5, 6, 7, 9 ,10]], 
   axis = 1, inplace = True)

In [33]:
e_data.columns[3]

'Country Name'

In [34]:
e_data.head()

   Latitude  Longitude  Magnitude   Country Name
0    19.246    145.616        6.0  United States
1    53.008   -162.008        6.4  United States
2    53.191   -161.859        6.3  United States
3    21.527    143.081        5.6  United States
4    53.292   -162.331        5.7  United States

In [39]:
data = e_data.items[], columns =['Latitude', 'Longitude', 'Magnitude', 'Country Name']

SyntaxError: invalid syntax (<ipython-input-39-cb8cc62ef3f3>, line 1)

In [ ]:
#a0 + a1 ∗ x1 + a2 ∗ x2 + a3 ∗ x3 + ... + ak ∗ xk = y,